Статистика работы механизмов/Конфигурация/DataProcessors/_ВосстановлениеПоследовательностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ВосстановлениеПоследовательностей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеГраницыПоследовательности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ВосстановлениеПоследовательностей/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПровестиДокументыПоследовательности(Организация, СчетДоверительногоУправления, ГраницаРегистратор, ГраницаПериод, ТочкаАктуальностиРегистратор)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОперацииПоСчетуДоверительногоУправления.Регистратор
		|ИЗ
		|	Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|ГДЕ
		|	ОперацииПоСчетуДоверительногоУправления.Организация = &Организация
		|	И ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен
		|	И ОперацииПоСчетуДоверительногоУправления.МоментВремени МЕЖДУ &МоментВремениГраница И &МоментВремениТочкаАктуальности
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОперацииПоСчетуДоверительногоУправления.МоментВремени";
		
	Запрос.УстановитьПараметр("Организация",                    Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",   СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("МоментВремениТочкаАктуальности", ТочкаАктуальностиРегистратор.МоментВремени());
	
	Попытка
		Запрос.УстановитьПараметр("МоментВремениГраница", ГраницаРегистратор.МоментВремени());
	Исключение
		// регистратор, м.б. удален и тогда в границе будет стоять битая ссылка
		Запрос.УстановитьПараметр("МоментВремениГраница", Новый МоментВремени(ГраницаПериод));
	КонецПопытки;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			Документ = Выборка.Регистратор.ПолучитьОбъект();
			Документ.ДополнительныеСвойства.Вставить("ГрупповоеПроведение", Истина);
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			//Сообщить(Документ);
		Исключение
			Сообщить("Документ " + Документ + " не проведен");
			Сообщить("Последовательность по счету д/у " + СчетДоверительногоУправления + " НЕ восстановлена");
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Сообщить("Последовательность по счету д/у " + СчетДоверительногоУправления + " восстановлена");
	Возврат Истина;
	
КонецФункции // ПровестиДокументыПоследовательности

&НаСервереБезКонтекста
Функция ПолучитьВсеДокументыЗаПериод(Организация, СчетДоверительногоУправления, Период)
	
	ШаблонПодзапроса =
		"	ВЫБРАТЬ
		|		ИмяДокумента.Ссылка,
		|		ИмяДокумента.МоментВремени
		|	ИЗ
		|		Документ.ИмяДокумента КАК ИмяДокумента
		|	ГДЕ
		|		ИмяДокумента.Организация = &Организация
		|		И ИмяДокумента.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ИмяДокумента.Проведен
		|		И ИмяДокумента.Дата МЕЖДУ &НачДата И &КонДата";
		
	Если Не ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда
		ШаблонПодзапроса = СтрЗаменить(ШаблонПодзапроса, "И ИмяДокумента.СчетДоверительногоУправления = &СчетДоверительногоУправления" + Символы.ПС, "");
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВсеДокументы.Ссылка,
		|	ВсеДокументы.МоментВремени
		|ИЗ
		|	(Подзапросы) КАК ВсеДокументы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВсеДокументы.МоментВремени";
		
	Подзапросы = "";
		
	Для каждого ДокументМД Из Метаданные.Документы Цикл
		Если ДокументМД.Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить Тогда
			Продолжить;
		КонецЕсли;
		
		Подзапросы = Подзапросы + ?(ПустаяСтрока(Подзапросы), "", Символы.ПС + Символы.ПС + " ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС) + СтрЗаменить(ШаблонПодзапроса, "ИмяДокумента", ДокументМД.Имя);
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подзапросы", Подзапросы);
	
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачДата",                      НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("КонДата",                      КонецДня(Период.ДатаОкончания));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ПолучитьВсеДокументыЗаПериод

&НаСервереБезКонтекста
Процедура УстановитьМонопольныйРежимВызов(Режим)
	
	Если Режим = Истина Тогда
		Попытка
			УстановитьМонопольныйРежим(Истина);
			Сообщить("Включен монопольный режим");
		Исключение
			Сообщить("Не удалось установить монопольный режим. Система сообщает:" + ОписаниеОшибки());
			Сообщить("Проведение будет выполнено в разделяемом режиме. Это может занять большее кол-во времени.");
		КонецПопытки;
		
	Иначе	
		Если МонопольныйРежим() Тогда
			УстановитьМонопольныйРежим(Ложь);
			Сообщить("Отключен монопольный режим");
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // УстановитьМонопольныйРежимВызов

&НаСервереБезКонтекста
Функция ПровестиДокументы(ДокументыДляПроведения, НачИнд, КонИнд)
	
	Для Инд = НачИнд По КонИнд Цикл
		Документ = ДокументыДляПроведения[Инд].ПолучитьОбъект();
		Документ.ДополнительныеСвойства.Вставить("ГрупповоеПроведение", Истина);
		
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось перепровести документ " + Документ);
			Сообщить("Перепроведение документов прервано.");
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ПровестиДокументы


&НаСервере
Процедура ОбновитьГраницыПоследовательностиНаСервере()
	
	ЭтаФорма.ГраницыПоследовательности.Очистить();
	
	// т.к. агрегирующие функции по моменту времени не работают,
	// поэтому выделим все документы, относящиеся к периоду, в котором
	// расположена точка актуальности (последний проведенный документ)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОперацииПоСчетуДоверительногоУправления.Организация,
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления,
		|	МАКСИМУМ(ОперацииПоСчетуДоверительногоУправления.Период) КАК Период
		|ПОМЕСТИТЬ _ПериодыАктуальности
		|ИЗ
		|	Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|ГДЕ
		|	ОперацииПоСчетуДоверительногоУправления.Организация = &Организация
		|	И ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен
		|	И ОперацииПоСчетуДоверительногоУправления.Период <= КОНЕЦПЕРИОДА(&ОграничениеГраницыПоследовательности, ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииПоСчетуДоверительногоУправления.Организация,
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления		
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОперацииПоСчетуДоверительногоУправления.Организация КАК Организация,
		|	ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОперацииПоСчетуДоверительногоУправления.Период,
		|	ОперацииПоСчетуДоверительногоУправления.Регистратор		
		|ИЗ
		|	_ПериодыАктуальности КАК _ПериодыАктуальности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.ОперацииПоСчетуДоверительногоУправления КАК ОперацииПоСчетуДоверительногоУправления
		|		ПО _ПериодыАктуальности.Организация = ОперацииПоСчетуДоверительногоУправления.Организация
		|			И _ПериодыАктуальности.СчетДоверительногоУправления = ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления
		|			И _ПериодыАктуальности.Период = ОперацииПоСчетуДоверительногоУправления.Период
		|			И ОперацииПоСчетуДоверительногоУправления.Регистратор.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	СчетДоверительногоУправления,
		|	МоментВремени УБЫВ";
		
	Если Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОперацииПоСчетуДоверительногоУправления.СчетДоверительногоУправления = &СчетДоверительногоУправления", "");
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.ОграничениеГраницыПоследовательности) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОперацииПоСчетуДоверительногоУправления.Период <= КОНЕЦПЕРИОДА(&ОграничениеГраницыПоследовательности, ДЕНЬ)", "");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Организация",                          Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",         Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ОграничениеГраницыПоследовательности", Объект.ОграничениеГраницыПоследовательности);
		
	ТочкиАктуальности = Запрос.Выполнить().Выгрузить();
	
	// удалим, документы, расположенные ранее точки актуальности
	Для Инд = 1 - ТочкиАктуальности.Количество() По -1 Цикл
		Если ТочкиАктуальности[-Инд].Организация = ТочкиАктуальности[-Инд - 1].Организация
			И ТочкиАктуальности[-Инд].СчетДоверительногоУправления = ТочкиАктуальности[-Инд - 1].СчетДоверительногоУправления
		Тогда
			ТочкиАктуальности.Удалить(-Инд);
		КонецЕсли;
	КонецЦикла;
	
	// соберем итоговые данные
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТочкиАктуальности.Организация,
		|	ТочкиАктуальности.СчетДоверительногоУправления,
		|	ТочкиАктуальности.Период,
		|	ТочкиАктуальности.Регистратор
		|ПОМЕСТИТЬ _ТочкиАктуальности
		|ИЗ
		|	&ТочкиАктуальности КАК ТочкиАктуальности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОперацииПоСчетуДоверительногоУправленияГраницы.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА &ОграничениеГраницыПоследовательности < ОперацииПоСчетуДоверительногоУправленияГраницы.Период
		|				И &ОграничениеГраницыПоследовательности <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ОграничениеГраницыПоследовательности
		|		ИНАЧЕ ОперацииПоСчетуДоверительногоУправленияГраницы.Период
		|	КОНЕЦ КАК ГраницаПериод,
		|	ВЫБОР
		|		КОГДА &ОграничениеГраницыПоследовательности < ОперацииПоСчетуДоверительногоУправленияГраницы.Период
		|				И &ОграничениеГраницыПоследовательности <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА _ТочкиАктуальности.Регистратор
		|		ИНАЧЕ ОперацииПоСчетуДоверительногоУправленияГраницы.Регистратор
		|	КОНЕЦ КАК ГраницаРегистратор,
		|	_ТочкиАктуальности.Период КАК ТочкаАктуальностиПериод,
		|	_ТочкиАктуальности.Регистратор КАК ТочкаАктуальностиРегистратор
		|ПОМЕСТИТЬ _ГраницыПоследовательности
		|ИЗ
		|	Последовательность.ОперацииПоСчетуДоверительногоУправления.Границы КАК ОперацииПоСчетуДоверительногоУправленияГраницы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТочкиАктуальности КАК _ТочкиАктуальности
		|		ПО ОперацииПоСчетуДоверительногоУправленияГраницы.Организация = _ТочкиАктуальности.Организация
		|			И ОперацииПоСчетуДоверительногоУправленияГраницы.СчетДоверительногоУправления = _ТочкиАктуальности.СчетДоверительногоУправления
		|ГДЕ
		|	ОперацииПоСчетуДоверительногоУправленияГраницы.Организация = &Организация
		|	И ОперацииПоСчетуДоверительногоУправленияГраницы.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ГраницыПоследовательности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ГраницыПоследовательности.ГраницаПериод,
		|	_ГраницыПоследовательности.ГраницаРегистратор,
		|	_ГраницыПоследовательности.ТочкаАктуальностиПериод,
		|	_ГраницыПоследовательности.ТочкаАктуальностиРегистратор,
		|	ВЫБОР
		|		КОГДА _ГраницыПоследовательности.ТочкаАктуальностиРегистратор <> _ГраницыПоследовательности.ГраницаРегистратор
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Актуальность,
		|	ВЫБОР
		|		КОГДА _ГраницыПоследовательности.ТочкаАктуальностиРегистратор <> _ГраницыПоследовательности.ГраницаРегистратор
		|			ТОГДА ""Восстановить""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Восстановить,
		|	""Состав"" КАК Состав
		|ИЗ
		|	_ГраницыПоследовательности КАК _ГраницыПоследовательности
		|
		|УПОРЯДОЧИТЬ ПО
		|	Актуальность,
		|	СчетДоверительногоУправления.Наименование";
		
	Если Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОперацииПоСчетуДоверительногоУправленияГраницы.СчетДоверительногоУправления = &СчетДоверительногоУправления", "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ОграничениеГраницыПоследовательности) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОперацииПоСчетуДоверительногоУправления.Период <= КОНЕЦПЕРИОДА(&ОграничениеГраницыПоследовательности, ДЕНЬ)", "");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ТочкиАктуальности", ТочкиАктуальности);
		
	ЭтаФорма.ГраницыПоследовательности.Загрузить(
		Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ОбновитьГраницыПоследовательностиНаСервере


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ОтборПоСчетуДоверительногоУправления И Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		Сообщить("Поле ""Счет доверительного управления"" не заполнено");
	КонецЕсли;
	
	Если ЭтаФорма.ОграничитьГраницуПоследовательности И Не ЗначениеЗаполнено(Объект.ОграничениеГраницыПоследовательности) Тогда
		Сообщить("Поле ""Точка актуальности"" не заполнено");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ОтборПоСчетуДоверительногоУправления = ЗначениеЗаполнено(Объект.СчетДоверительногоУправления);
	ЭтаФорма.ОграничитьГраницуПоследовательности  = ЗначениеЗаполнено(Объект.ОграничениеГраницыПоследовательности);
	
	Элементы.СчетДоверительногоУправления.Видимость         = ЭтаФорма.ОтборПоСчетуДоверительногоУправления;
	Элементы.ОграничениеГраницыПоследовательности.Видимость = ЭтаФорма.ОграничитьГраницуПоследовательности;
	
	ОбновитьГраницыПоследовательностиНаСервере();

КонецПроцедуры


&НаКлиенте
Процедура ОтборПоСчетуДоверительногоУправленияПриИзменении(Элемент)
	
	Элементы.СчетДоверительногоУправления.Видимость = ЭтаФорма.ОтборПоСчетуДоверительногоУправления;
	
	Если Не ЭтаФорма.ОтборПоСчетуДоверительногоУправления Тогда
		Объект.СчетДоверительногоУправления = Неопределено;
	КонецЕсли;
	
	ОбновитьГраницыПоследовательностиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьГраницуПоследовательностиПриИзменении(Элемент)
	
	Элементы.ОграничениеГраницыПоследовательности.Видимость = ЭтаФорма.ОграничитьГраницуПоследовательности;
	
	Если Не ЭтаФорма.ОграничитьГраницуПоследовательности Тогда
		Объект.ОграничениеГраницыПоследовательности = Неопределено;
	КонецЕсли;
	
	ОбновитьГраницыПоследовательностиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГраницыПоследовательностиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.ГраницыПоследовательности.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяКолонка = Элементы.ГраницыПоследовательности.ТекущийЭлемент;
	
	Если      ТекущаяКолонка = Элементы.ГраницыПоследовательностиСчетДоверительногоУправления Тогда
		ОткрытьЗначение(ТекущиеДанные.СчетДоверительногоУправления);
		
	ИначеЕсли ТекущаяКолонка = Элементы.ГраницыПоследовательностиГраницаРегистратор Тогда
		ОткрытьЗначение(ТекущиеДанные.ГраницаРегистратор);
		
	ИначеЕсли ТекущаяКолонка = Элементы.ГраницыПоследовательностиТочкаАктуальностиРегистратор Тогда
		ОткрытьЗначение(ТекущиеДанные.ТочкаАктуальностиРегистратор);
		
	ИначеЕсли ТекущаяКолонка = Элементы.ГраницыПоследовательностиВосстановить И Не ТекущиеДанные.Актуальность Тогда
		Если Вопрос("Восстановить последовательность документов по клиенту " + ТекущиеДанные.СчетДоверительногоУправления + "?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			УстановитьМонопольныйРежимВызов(Истина);
			
			ПровестиДокументыПоследовательности(
				Объект.Организация,
				ТекущиеДанные.СчетДоверительногоУправления,
				ТекущиеДанные.ГраницаРегистратор,
				ТекущиеДанные.ГраницаПериод,
				ТекущиеДанные.ТочкаАктуальностиРегистратор);
				
			УстановитьМонопольныйРежимВызов(Ложь);
				
			ОбновитьГраницыПоследовательностиНаСервере();
		КонецЕсли;
		
	ИначеЕсли ТекущаяКолонка = Элементы.ГраницыПоследовательностиСостав Тогда
		ОткрытьФорму("ВнешняяОбработка._ВосстановлениеПоследовательностей.Форма.ДокументыПоследовательности",
			Новый Структура("Организация, СчетДоверительногоУправления, ОграничениеГраницыПоследовательности",
				Объект.Организация,
				ТекущиеДанные.СчетДоверительногоУправления,
				Объект.ОграничениеГраницыПоследовательности),
			ЭтаФорма);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничениеГраницыПоследовательностиПриИзменении(Элемент)
	
	ОбновитьГраницыПоследовательностиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ОбновитьГраницыПоследовательностиНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОбновитьГраницыПоследовательностиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВосстановитьВсе(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Вопрос("Восстановить последовательности по всем счетам д/у? Процесс может занять продолжительное время.", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМонопольныйРежимВызов(Истина);
	
	Для каждого СтрокаГраницыПоследовательности Из ГраницыПоследовательности Цикл
		Если Не СтрокаГраницыПоследовательности.Актуальность Тогда
			ПровестиДокументыПоследовательности(
				Объект.Организация,
				СтрокаГраницыПоследовательности.СчетДоверительногоУправления,
				СтрокаГраницыПоследовательности.ГраницаРегистратор,
				СтрокаГраницыПоследовательности.ГраницаПериод,
				СтрокаГраницыПоследовательности.ТочкаАктуальностиРегистратор);
		КонецЕсли;
		
		ОбработкаПрерыванияПользователя();
	КонецЦикла;
	
	УстановитьМонопольныйРежимВызов(Ложь);
	
	ОбновитьГраницыПоследовательностиНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерепровестиВсеДокументыЗаПериод(Команда)
	
	ВыбПериод = Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
	
	ФормаВыбораПериода = ПолучитьФорму("ОбщаяФорма.ВыборПериода", Новый Структура("Период", ВыбПериод), ЭтаФорма);
	ВыбПериод          = ФормаВыбораПериода.ОткрытьМодально();
	
	Если ВыбПериод = КодВозвратаДиалога.Отмена Или ВыбПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВсеДокументыЗаПериод = ПолучитьВсеДокументыЗаПериод(Объект.Организация, Объект.СчетДоверительногоУправления, ВыбПериод);
	
	Всего = ВсеДокументыЗаПериод.Количество();
	
	Если Всего = 0 Тогда
		Сообщить("Документов за указанный период не обнаружено.");
		Возврат;
	Иначе
		Сообщить("Всего найдено документов: " + Всего + ".");
	КонецЕсли;
	
	Сообщить("Начало выполнения:" + ТекущаяДата());
	
	УстановитьМонопольныйРежимВызов(Истина);
	
	// проводить будем блоками, чтобы видеть прогресс
	Шаг         = 100;
	ИндНачБлока = 0;
	ИндКонБлока = Мин(Шаг - 1, Всего - 1);
	
	Пока Истина Цикл
		Если Не ПровестиДокументы(ВсеДокументыЗаПериод, ИндНачБлока, ИндКонБлока) Тогда
			Прервать;
		КонецЕсли;
			
		Состояние("Проведено документов " + (ИндКонБлока + 1) + "/" + Всего, Цел(ИндКонБлока / Всего * 100));
		
		ИндНачБлока = ИндНачБлока + Шаг;
		Если ИндНачБлока >= Всего Тогда
			Прервать;
		КонецЕсли;
		
		ИндКонБлока = Мин(ИндКонБлока + Шаг, Всего - 1);
		
		ОбработкаПрерыванияПользователя();
	КонецЦикла;
	
	УстановитьМонопольныйРежимВызов(Ложь);
	
	Сообщить("Окончание выполнения:" + ТекущаяДата());
	
	КомандаОбновить(Неопределено);
	
КонецПроцедуры
